# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Whether to enable performance analysis for each layer of the model
profile: true

# Parameters
nc: 15  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# each kernel for each head in CGA
token_kernels: [7, 5, 3, 3]

# the down-sampling rate of the first EfficientViT Block passed in
patch_size: 16

# input image size to model
resolution: 640

# the hidden ratio in FFN, which is less than other Transformer, such as Transformer, ViT, Swin, MobilViT, DETR, BiFormer...
hidden_ratio: 2

# global activation function
act_layer: 'hardswish'

# EfficientViT backbone
backbone:
  # [from, repeats, module, args]
   - [-1, 1, EfficientViTPE, [128, -1]] # 0-P1/16
   - [-1, 1, EfficientViTBlock, [128, 'window_attention', 16, 4, 7, -1]] # -1表示当所需要的resolution参数来自于resolutions[-1]
   - [-1, 1, EfficientViTPM, [256, -1]] # 2-P2/32
   - [-1, 2, EfficientViTBlock, [256, 'window_attention', 16, 4, 7, -1]]
   - [-1, 1, EfficientViTPM, [384, -1]] # 4-P3/64
   - [-1, 3, EfficientViTBlock, [384, 'window_attention', 16, 4, 7, -1]]
   - [-1, 1, SPPF, [1024, 5]]  # 6


# AFPN neck + head
head:
  - [[1, 3, 6], 1, AFPNC2f, [1.0, 'hardswish', 3]]
  # 解耦头
  - [[-3, -2, -1], 1, Detect, [nc]]  # Detect(P3, P4, P5)
