
# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# global activation function
act_layer: 'SiLU'

# size of each patch divided by the whole image
patch_size: 2

# the output of each layer
out_chans:
  xxs: [16, 16, 24, 24, 48, 48, 64, 64, 80, 80, 320]
  xs: [16, 32, 48, 48, 64, 64, 80, 80, 96, 96, 384]
  s: [16, 32, 64, 64, 96, 96, 128, 128, 160, 160, 640]

# the dimension of each Transformer Block in MobileViT Block
dims:
  xxs: [64, 80, 96]
  xs: [96, 120, 144]
  s: [144, 168, 192]

n_repeat_transformer: [2, 4, 3]

# the number of multi-head
head_num: 8

# hidden layer in MLP
mlp_ratio: 4.

# kernel size in Transformer Block
kernel_size: 3

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [16, 3, 2]]  # 0-P1/2
  - [-1, 1, MV2Block, [32, 1, 4]]

  - [-1, 1, MV2Block, [48, 2, 4]] # 2-P2/4
  - [-1, 2, MV2Block, [48, 1, 4]]

  - [-1, 1, MV2Block, [64, 2, 4]] # 4-P3/8
  - [-1, 1, MobileViTBlock, [64, 96, 2]]

  - [-1, 1, MV2Block, [80, 2, 4]] # 6-P4/16
  - [-1, 1, MobileViTBlock, [80, 120, 4]]

  - [-1, 1, MV2Block, [96, 2, 4]] # 8-P5/32
  - [-1, 1, MobileViTBlock, [96, 144, 3]]
  - [-1, 1, Conv, [384, 1, 1]]
  - [-1, 1, SPPF, [1024, 5]]  # 11

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 7], 1, Concat, [1]]  # cat backbone P4
  # 这里的3表示c2f中重复的Bottleneck个数
  - [-1, 3, C2f, [512]]  # 14

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 17 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 20 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 23 (P5/32-large)

  # 解耦头
  - [[17, 20, 23], 1, Detect, [nc]]  # Detect(P3, P4, P5)
