# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Whether to enable performance analysis for each layer of the model
profile: true

# Parameters
nc: 12  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# the input channel FasterNet patch length
embed_dim:
  0: 40
  1: 64
  2: 96
  s: 128
  m: 144
  l: 192

# the depths of FasterNet
depths:
  0: [1, 2, 8, 2]
  1: [1, 2, 8, 2]
  2: [1, 2, 8, 2]
  s: [1, 2, 13, 2]
  m: [3, 4, 18, 3]
  l: [3, 4, 18, 3]
# the params of patch embedding and patch merging
patch_size: 4
patch_stride: 4
patch_size2: 2
patch_stride2: 2

# partial ratio
n_div: 4

# stochastic depth decay
drop_path_rate:
  0: 0.
  1: 0.02
  2: 0.05
  s: 0.1
  m: 0.2
  l: 0.3

act_layer:
  0: GELU
  1: GELU
  2: RELU
  s: RELU
  m: RELU
  l: RELU



# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, PatchEmbedding, []] # /4
  - [-1, 1, FasterBasicStage, [0, True]]  # 0 means the layer of current stage, True means add norm to each stage

  - [-1, 1, PatchMerging, [1]]  # 2/8
  - [-1, 1, FasterBasicStage, [1, True]]

  - [-1, 1, PatchMerging, [2]] # 4/16
  - [-1, 1, FasterBasicStage, [2, True]]

  - [ -1, 1, PatchMerging, [3]] # 6/32
  - [ -1, 1, FasterBasicStage, [3, True]]

  #  - [-1, 1, FasterNet, []]  # 3
  - [-1, 1, SPPF, [1024, 5]]  # 8

# YOLOv8.0n head
head:
  # [from, repeats, module, args]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]  # cat backbone P2
  # 这里的3表示c2f中重复的Bottleneck个数
  - [-1, 3, C2f, [512]]  # 11

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 3], 1, Concat, [1]]  # cat backbone P1
  - [-1, 3, C2f, [256]]  # 14 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 17 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 20 (P5/32-large)

  # 解耦头
  - [[14, 17, 20], 1, Detect, [nc]]  # Detect(P3, P4, P5)
